Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
         <register caption="" name="CFD1FIFOUA31" offset="0x730" rw="RW" size="4">
            <bitfield caption="FIFO User Address bits" mask="0xFFFFFFFF" name="FIFOUA" />
         </register>
         <register caption="Filter Control Register" name="CFD1FLTCON0" offset="0x740" rw="RW" size="4">
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F0BP" values="CFD1FLTCON0__F0BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN0" values="CFD1FLTCON0__FLTEN0" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F1BP" values="CFD1FLTCON0__F1BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN1" values="CFD1FLTCON0__FLTEN1" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F2BP" values="CFD1FLTCON0__F2BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN2" values="CFD1FLTCON0__FLTEN2" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F3BP" values="CFD1FLTCON0__F3BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN3" values="CFD1FLTCON0__FLTEN3" />
         </register>
         <register caption="Filter Control Registe" name="CFD1FLTCON1" offset="0x750" rw="RW" size="4">
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F4BP" values="CFD1FLTCON1__F4BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN4" values="CFD1FLTCON1__FLTEN4" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F5BP" values="CFD1FLTCON1__F5BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN5" values="CFD1FLTCON1__FLTEN5" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F6BP" values="CFD1FLTCON1__F6BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN6" values="CFD1FLTCON1__FLTEN6" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F7BP" values="CFD1FLTCON1__F7BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN7" values="CFD1FLTCON1__FLTEN7" />
         </register>
         <register caption="Filter Control Register" name="CFD1FLTCON2" offset="0x760" rw="RW" size="4">
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F8BP" values="CFD1FLTCON2__F8BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN8" values="CFD1FLTCON2__FLTEN8" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F9BP" values="CFD1FLTCON2__F9BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN9" values="CFD1FLTCON2__FLTEN9" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F10BP" values="CFD1FLTCON2__F10BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN10" values="CFD1FLTCON2__FLTEN10" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F11BP" values="CFD1FLTCON2__F11BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN11" values="CFD1FLTCON2__FLTEN11" />
         </register>
         <register caption="Filter Control Register" name="CFD1FLTCON3" offset="0x770" rw="RW" size="4">
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F12BP" values="CFD1FLTCON3__F12BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN12" values="CFD1FLTCON3__FLTEN12" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F13BP" values="CFD1FLTCON3__F13BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN13" values="CFD1FLTCON3__FLTEN13" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F14BP" values="CFD1FLTCON3__F14BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN14" values="CFD1FLTCON3__FLTEN14" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F15BP" values="CFD1FLTCON3__F15BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN15" values="CFD1FLTCON3__FLTEN15" />
         </register>
         <register caption="Filter Control Register" name="CFD1FLTCON4" offset="0x780" rw="RW" size="4">
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F16BP" values="CFD1FLTCON4__F16BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN16" values="CFD1FLTCON4__FLTEN16" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F17BP" values="CFD1FLTCON4__F17BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN17" values="CFD1FLTCON4__FLTEN17" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F18BP" values="CFD1FLTCON4__F18BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN18" values="CFD1FLTCON4__FLTEN18" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F19BP" values="CFD1FLTCON4__F19BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN19" values="CFD1FLTCON4__FLTEN19" />
         </register>
         <register caption="Filter Control Register" name="CFD1FLTCON5" offset="0x790" rw="RW" size="4">
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F20BP" values="CFD1FLTCON5__F20BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN20" values="CFD1FLTCON5__FLTEN20" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F21BP" values="CFD1FLTCON5__F21BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN21" values="CFD1FLTCON5__FLTEN21" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F22BP" values="CFD1FLTCON5__F22BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN22" values="CFD1FLTCON5__FLTEN22" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F23BP" values="CFD1FLTCON5__F23BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN23" values="CFD1FLTCON5__FLTEN23" />
         </register>
         <register caption="Filter Control Register" name="CFD1FLTCON6" offset="0x7a0" rw="RW" size="4">
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x0000001F" name="F24BP" values="CFD1FLTCON6__F24BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00000080" name="FLTEN24" values="CFD1FLTCON6__FLTEN24" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x00001F00" name="F25BP" values="CFD1FLTCON6__F25BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00008000" name="FLTEN25" values="CFD1FLTCON6__FLTEN25" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x001F0000" name="F26BP" values="CFD1FLTCON6__F26BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x00800000" name="FLTEN26" values="CFD1FLTCON6__FLTEN26" />
            <bitfield caption="Pointer to Object when Filter n hits bits" mask="0x1F000000" name="F27BP" values="CFD1FLTCON6__F27BP" />
            <bitfield caption="Enable Filter n to Accept Messages bits" mask="0x80000000" name="FLTEN27" values="CFD1FLTCON6__FLTEN27" />
         </register>
