Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
         <register caption="Filter Object Register" name="CFD1MASK5" offset="0x870" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK5__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK5__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ6" offset="0x880" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ6__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ6__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK6" offset="0x890" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK6__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK6__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ7" offset="0x8a0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ7__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ7__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK7" offset="0x8b0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK7__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK7__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ8" offset="0x8c0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ8__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ8__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK8" offset="0x8d0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK8__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK8__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ9" offset="0x8e0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ9__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ9__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK9" offset="0x8f0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK9__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK9__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ10" offset="0x900" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ10__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ10__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK10" offset="0x910" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK10__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK10__MIDE" />
         </register>
         <register caption="Filter Object Registe" name="CFD1FLTOBJ11" offset="0x920" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ11__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ11__EXIDE" />
         </register>
         <register caption="Filter Object Registe" name="CFD1MASK11" offset="0x930" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK11__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK11__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ12" offset="0x940" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ12__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ12__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK12" offset="0x950" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK12__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK12__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ13" offset="0x960" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ13__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ13__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK13" offset="0x970" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK13__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK13__MIDE" />
         </register>
