Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
      <value-group caption="Transmitter in Error State Warning bit (128 greater than TERRCNT greater than 95)" name="CFD1TREC__TXWARN">
         <value caption="Indicates that the number of transmit errors are less than 128" name="" value="0x1" />
         <value caption="Indicates that transmit errors are greater than or equal to 95" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver in Error State Bus Passive bit (RERRCNT greater than 127)" name="CFD1TREC__RXBP">
         <value caption="Indicates that the number of receive errors is greater than 127." name="" value="0x1" />
         <value caption="Indicates that transmit errors are less than or equal to 127" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmitter in Error State Bus Passive bit (TERRCNT greater than 127)" name="CFD1TREC__TXBP">
         <value caption="Indicates that the number of transmit errors is greater than 127." name="" value="0x1" />
         <value caption="Indicates that transmit errors are less than or equal to 127" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmitter in Error State Bus Off bit (TERRCNT greater than 255)" name="CFD1TREC__TXBO">
         <value caption="Indicates that the number of transmit errors is greater than 255." name="" value="0x1" />
         <value caption="Indicates that transmit errors are less than 255" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Free Message Counter Status bits" name="CFD1BDIAG1__EFMSGCNT">
         <value caption="65536 error free messages since the last register read" name="" value="0xffff" />
         <value caption="0 error free messages since the last register read" name="" value="0x0" />
      </value-group>
      <value-group caption="Nominal Bit Logical 0 Error Status bit" name="CFD1BDIAG1__NBIT0ERR">
         <value caption="During the transmission of a nominal message" name="" value="0x1" />
         <value caption="No nominal bit logical 0 error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Nominal Bit Logical 1 Error Status bit" name="CFD1BDIAG1__NBIT1ERR">
         <value caption="During the transmission of a nominal message (with the exception of the arbitration field)" name="" value="0x1" />
         <value caption="No nominal bit logical 1 error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Not Acknowledged Error Status bit" name="CFD1BDIAG1__NACKERR">
         <value caption="A transmitted message was not acknowledged" name="" value="0x1" />
         <value caption="A transmitted message was acknowledged" name="" value="0x0" />
      </value-group>
      <value-group caption="Nominal Format Error Status bit" name="CFD1BDIAG1__NFORMERR">
         <value caption="A fixed format portion of a nominal received frame has the wrong format" name="" value="0x1" />
         <value caption="No nominal format error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Nominal Stuffing Error Status bit" name="CFD1BDIAG1__NSTUFERR">
         <value caption="More than five equal bits in a sequence have occurred in a part of a nominal received message where this is not allowed" name="" value="0x1" />
         <value caption="No nominal bit stuffing errors have occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Nominal CRC Error Status bit" name="CFD1BDIAG1__NCRCERR">
         <value caption="The CRC checksum of a nominal received message was incorrect." name="" value="0x1" />
         <value caption="No nominal CRC received message error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Bus Off Error Status bit" name="CFD1BDIAG1__TXBOERR">
         <value caption="Transmit error occurred and device enter Bus Off mode and automatically recovered" name="" value="0x1" />
         <value caption="No transmit Bus Off error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Bit Logical 0 Error Status bit" name="CFD1BDIAG1__DBIT0ERR">
         <value caption="During the data transmission of a message the monitored bus value was recessive.  During Bus Off recovery, this status is set each time a sequence of 11 recessive bits has been monitored." name="" value="0x1" />
         <value caption="No data logical 0 bit transmission error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Bit Logical 1 Error Status bit" name="CFD1BDIAG1__DBIT1ERR">
         <value caption="During the data transmission of a message (with the exception of the arbitration field)" name="" value="0x1" />
         <value caption="No data logical 1 bit transmission error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Format Error Status bit" name="CFD1BDIAG1__DFORMERR">
         <value caption="Data fixed format portion of a received frame has the wrong format" name="" value="0x1" />
         <value caption="No format errors occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Stuffing Error Status bit" name="CFD1BDIAG1__DSTUFERR">
         <value caption="More than five equal bits in a sequence have occurred in a portion of a received message where this is not allowed" name="" value="0x1" />
         <value caption="No data received message errors" name="" value="0x0" />
      </value-group>
      <value-group caption="Data CRC Error Status bit" name="CFD1BDIAG1__DCRCERR">
         <value caption="CRC checksum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data" name="" value="0x1" />
         <value caption="No received message data CRC error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Error State Indicator (ESI) Flag Status bit" name="CFD1BDIAG1__ESI">
         <value caption="ESI flag of a received CAN FD message was set" name="" value="0x1" />
         <value caption="ESI flag of a received CAN FD message was not set" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Length Code (DLC) Mismatch Status bit" name="CFD1BDIAG1__DLCMM">
         <value caption="Payload size error. During a transmission or reception the Data Length Code exceeds the payload size of the FIFO element defined in the PLSIZE bits (CFDxFIFOCONn)." name="" value="0x1" />
         <value caption="No payload size error occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Event FIFO Not Empty Interrupt Enable bit" name="CFD1TEFCON__TEFNEIE">
         <value caption="Interrupt enabled for FIFO not empty" name="" value="0x1" />
         <value caption="Interrupt disabled for FIFO not empty" name="" value="0x0" />
      </value-group>
