Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ26__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK26__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK26__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ27__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ27__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK27__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK27__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ28__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ28__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK28__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK28__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ29__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ29__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK29__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK29__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Filter bit" name="CFD1FLTOBJ30__SID11">
         <value caption="Extended standard identifier to 12-bit (i.e." name="" value="0x1" />
         <value caption="Do not use extended standard Identifier bits" name="" value="0x0" />
      </value-group>
      <value-group caption="Extended Identifier Enable bit" name="CFD1FLTOBJ30__EXIDE">
         <value caption="(If MIDE is 1) Match only messages with extended identifier addresses" name="" value="0x1" />
         <value caption="(If MIDE is 1) Match only messages with standard identifier addresses" name="" value="0x0" />
      </value-group>
      <value-group caption="Standard Identifier Mask bit" name="CFD1MASK30__MSID11">
         <value caption="Enable extended standard identifier mask to 12 bits (MSID" name="" value="0x1" />
         <value caption="Do not enable extended standard identifier mask (MSID)" name="" value="0x0" />
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="CFD1MASK30__MIDE">
         <value caption="Match only message types (standard or extended address) that correspond to EXIDE bit in filter" name="" value="0x1" />
         <value caption="Match either standard or extended address message if filters match (i.e." name="" value="0x0" />
      </value-group>
