Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RCON__DMTO">
         <value caption="A DMT time-out has occurred" name="" value="0x1" />
         <value caption="A DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Flag bit" name="RCON__SWR">
         <value caption="Software Reset was executed" name="" value="0x1" />
         <value caption="Software Reset was not executed" name="" value="0x0" />
      </value-group>
      <value-group caption="External Reset (MCLR) Pin Flag bit" name="RCON__EXTR">
         <value caption="Master Clear (pin) Reset has occurred" name="" value="0x1" />
         <value caption="Master Clear (pin) Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Configuration Mismatch Reset Flag bit" name="RCON__CMR">
         <value caption="A Configuration Mismatch Reset has occurred" name="" value="0x1" />
         <value caption="A Configuration Mismatch Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary/Secondary Configuration Registers Error Flag bit" name="RCON__BCFGFAIL">
         <value caption="An error occurred during a read of the primary and alternate configuration registers" name="" value="0x1" />
         <value caption="No error occurred during a read of the primary and alternate configuration registers" name="" value="0x0" />
      </value-group>
      <value-group caption="Primary Configuration Registers Error Flag bit" name="RCON__BCFGERR">
         <value caption="An error occurred during a read of the primary configuration registers" name="" value="0x1" />
         <value caption="No error occurred during a read of the primary configuration registers" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset Trigger bit" name="RSWRST__SWRST">
         <value caption="Enable software Reset event" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="NMI Reset Counter Value bits" name="RNMICON__NMICNT">
         <value caption="65535 SYSCLK cycles before a device Reset occurs" name="" value="0xffff" />
         <value caption="1 SYSCLK cycle before a device Reset occurs" name="" value="0x1" />
         <value caption="No delay between NMI assertion and device Reset event" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="RNMICON__CF">
         <value caption="FSCM has detected clock failure and caused an NMI" name="" value="0x1" />
         <value caption="FSCM has not detected clock failure" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detect Status" name="RNMICON__HLVD">
         <value caption="Indicates HLVD Event interrupt is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event interrupt is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="General NMI bit" name="RNMICON__GNMI">
         <value caption="A general NMI event has been detected or a user-initiated NMI event has occurred" name="" value="0x1" />
         <value caption="A general NMI event has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Software NMI Trigger" name="RNMICON__SWNMI">
         <value caption="An NMI will be generated" name="" value="0x1" />
         <value caption="An NMI will not be generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-Out Flag bit" name="RNMICON__WDTO">
         <value caption="WDT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="WDT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Deadman Timer Time-out Flag bit" name="RNMICON__DMTO">
         <value caption="DMT time-out has occurred and caused a NMI" name="" value="0x1" />
         <value caption="DMT time-out has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Regulator Stand-by Enable bit" name="PWRCON__VREGS">
         <value caption="Voltage regulator will remain active during Sleep" name="" value="0x1" />
         <value caption="Voltage regulator will go to Stand-by mode during Sleep" name="" value="0x0" />
      </value-group>
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
         <value caption="Initiate an oscillator switch to selection specified by NOSC bits" name="" value="0x1" />
         <value caption="Oscillator switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator (Sosc) Enable bit" name="OSCCON__SOSCEN">
         <value caption="Enable Secondary Oscillator" name="" value="0x1" />
         <value caption="Disable Secondary Oscillator" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="OSCCON__CF">
         <value caption="FSCM has detected a clock failure" name="" value="0x1" />
         <value caption="No clock failure has been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Sleep Mode Enable bit" name="OSCCON__SLPEN">
         <value caption="Device will enter Sleep mode when a WAIT instruction is executed" name="" value="0x1" />
         <value caption="Device will enter Idle mode when a WAIT instruction is executed" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Selection Lock Enable bit" name="OSCCON__CLKLOCK">
         <value caption="Clock and PLL selections are locked" name="" value="0x1" />
         <value caption="Clock and PLL selections are not locked and may be modified" name="" value="0x0" />
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Backup Fast RC (BFRC) Oscillator" name="" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="" value="0x5" />
         <value caption="Secondary Oscillator" name="" value="0x4" />
         <value caption="Reseerved" name="" value="0x3" />
         <value caption="Primary Oscillator (Posc) (HS or EC)" name="" value="0x2" />
         <value caption="System PLL (SPLL) input clock and divider set by SPLLCON" name="" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV) supports FRN divided by N" name="" value="0x0" />
      </value-group>
      <value-group caption="Current Oscillator Selection bits" name="OSCCON__COSC">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Backup Fast RC (BFRC) Oscillator" name="" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="" value="0x5" />
         <value caption="Secondary Oscillator" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Primary Oscillator (Posc) (HS or EC)" name="" value="0x2" />
         <value caption="System PLL (SPLL) input clock and divider set by SPLLCON" name="" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV) supports FRN divided by N" name="" value="0x0" />
      </value-group>
      <value-group caption="Sleep Two-speed Start-up Control bit" name="OSCCON__SLP2SPD">
         <value caption="Use FRC as SYSCLK until the selected clock is ready" name="" value="0x1" />
         <value caption="Use the selected clock directly" name="" value="0x0" />
      </value-group>
      <value-group caption="Dream Mode Enable bit" name="OSCCON__DRMEN">
         <value caption="Dream mode is enabled" name="" value="0x1" />
         <value caption="Dream mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Fast RC Oscillator Clock Divider bits" name="OSCCON__FRCDIV">
         <value caption="FRC divided by 256" name="DIV256" value="0x7" />
         <value caption="FRC divided by 64" name="DIV64" value="0x6" />
         <value caption="FRC divided by 32" name="DIV32" value="0x5" />
         <value caption="FRC divided by 16" name="DIV16" value="0x4" />
         <value caption="FRC divided by 8" name="DIV8" value="0x3" />
         <value caption="FRC divided by 4" name="DIV4" value="0x2" />
         <value caption="FRC divided by 2" name="DIV2" value="0x1" />
         <value caption="FRC divided by 1 (default setting)" name="DIV1" value="0x0" />
      </value-group>
      <value-group caption="FRC Oscillator Tuning bits" name="OSCTUN__TUN">
         <value caption="+1.453%" name="" value="0x3f" />
         <value caption="0.000% (Nominal Center Frequency" name="" value="0x20" />
         <value caption="-1.500%" name="" value="0x0" />
      </value-group>
      <value-group caption="System PLL Frequency Range Selection bits" name="SPLLCON__PLLRANGE">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="54-64 MHz" name="RANGE_54_64_MHZ" value="0x6" />
         <value caption="34-64 MHz" name="RANGE_34_64_MHZ" value="0x5" />
         <value caption="21-42 MHz" name="RANGE_21_42_MHZ" value="0x4" />
         <value caption="13-26 MHz" name="RANGE_13_26_MHZ" value="0x3" />
         <value caption="8-16 MHz" name="RANGE_8_16_MHZ" value="0x2" />
         <value caption="5-10 MHz" name="RANGE_5_10_MHZ" value="0x1" />
         <value caption="Bypass" name="BYPASS" value="0x0" />
      </value-group>
      <value-group caption="System PLL Input Clock Source bit" name="SPLLCON__PLLICLK">
         <value caption="FRC is selected as the input to the System PLL" name="" value="0x1" />
         <value caption="Posc is selected as the input to the System PLL" name="" value="0x0" />
      </value-group>
      <value-group caption="System PLL Input Clock Divider bits" name="SPLLCON__PLLIDIV">
         <value caption="Divide by 8" name="DIV_8" value="0x7" />
         <value caption="Divide by 7" name="DIV_7" value="0x6" />
         <value caption="Divide by 6" name="DIV_6" value="0x5" />
         <value caption="Divide by 5" name="DIV_5" value="0x4" />
         <value caption="Divide by 4" name="DIV_4" value="0x3" />
         <value caption="Divide by 3" name="DIV_3" value="0x2" />
         <value caption="Divide by 2" name="DIV_2" value="0x1" />
         <value caption="Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="System PLL Multiplier bits" name="SPLLCON__PLLMULT">
         <value caption="Multiply by 128" name="MUL_128" value="0x7f" />
         <value caption="Multiply by 127" name="MUL_127" value="0x7e" />
         <value caption="Multiply by 126" name="MUL_126" value="0x7d" />
         <value caption="Multiply by 125" name="MUL_125" value="0x7c" />
         <value caption="Multiply by 124" name="MUL_124" value="0x7b" />
         <value caption="Multiply by 123" name="MUL_123" value="0x7a" />
         <value caption="Multiply by 122" name="MUL_122" value="0x79" />
         <value caption="Multiply by 121" name="MUL_121" value="0x78" />
         <value caption="Multiply by 120" name="MUL_120" value="0x77" />
         <value caption="Multiply by 119" name="MUL_119" value="0x76" />
         <value caption="Multiply by 118" name="MUL_118" value="0x75" />
         <value caption="Multiply by 117" name="MUL_117" value="0x74" />
         <value caption="Multiply by 116" name="MUL_116" value="0x73" />
         <value caption="Multiply by 115" name="MUL_115" value="0x72" />
         <value caption="Multiply by 114" name="MUL_114" value="0x71" />
         <value caption="Multiply by 113" name="MUL_113" value="0x70" />
         <value caption="Multiply by 112" name="MUL_112" value="0x6f" />
         <value caption="Multiply by 111" name="MUL_111" value="0x6e" />
         <value caption="Multiply by 110" name="MUL_110" value="0x6d" />
         <value caption="Multiply by 109" name="MUL_109" value="0x6c" />
         <value caption="Multiply by 108" name="MUL_108" value="0x6b" />
         <value caption="Multiply by 107" name="MUL_107" value="0x6a" />
         <value caption="Multiply by 106" name="MUL_106" value="0x69" />
         <value caption="Multiply by 105" name="MUL_105" value="0x68" />
         <value caption="Multiply by 104" name="MUL_104" value="0x67" />
         <value caption="Multiply by 103" name="MUL_103" value="0x66" />
         <value caption="Multiply by 102" name="MUL_102" value="0x65" />
         <value caption="Multiply by 101" name="MUL_101" value="0x64" />
         <value caption="Multiply by 100" name="MUL_100" value="0x63" />
         <value caption="Multiply by 99" name="MUL_99" value="0x62" />
         <value caption="Multiply by 98" name="MUL_98" value="0x61" />
         <value caption="Multiply by 97" name="MUL_97" value="0x60" />
         <value caption="Multiply by 96" name="MUL_96" value="0x5f" />
         <value caption="Multiply by 95" name="MUL_95" value="0x5e" />
         <value caption="Multiply by 94" name="MUL_94" value="0x5d" />
         <value caption="Multiply by 93" name="MUL_93" value="0x5c" />
         <value caption="Multiply by 92" name="MUL_92" value="0x5b" />
         <value caption="Multiply by 91" name="MUL_91" value="0x5a" />
         <value caption="Multiply by 90" name="MUL_90" value="0x59" />
         <value caption="Multiply by 89" name="MUL_89" value="0x58" />
         <value caption="Multiply by 88" name="MUL_88" value="0x57" />
         <value caption="Multiply by 87" name="MUL_87" value="0x56" />
         <value caption="Multiply by 86" name="MUL_86" value="0x55" />
         <value caption="Multiply by 85" name="MUL_85" value="0x54" />
         <value caption="Multiply by 84" name="MUL_84" value="0x53" />
         <value caption="Multiply by 83" name="MUL_83" value="0x52" />
         <value caption="Multiply by 82" name="MUL_82" value="0x51" />
         <value caption="Multiply by 81" name="MUL_81" value="0x50" />
         <value caption="Multiply by 80" name="MUL_80" value="0x4f" />
         <value caption="Multiply by 79" name="MUL_79" value="0x4e" />
         <value caption="Multiply by 78" name="MUL_78" value="0x4d" />
         <value caption="Multiply by 77" name="MUL_77" value="0x4c" />
         <value caption="Multiply by 76" name="MUL_76" value="0x4b" />
         <value caption="Multiply by 75" name="MUL_75" value="0x4a" />
         <value caption="Multiply by 74" name="MUL_74" value="0x49" />
         <value caption="Multiply by 73" name="MUL_73" value="0x48" />
         <value caption="Multiply by 72" name="MUL_72" value="0x47" />
         <value caption="Multiply by 71" name="MUL_71" value="0x46" />
         <value caption="Multiply by 70" name="MUL_70" value="0x45" />
         <value caption="Multiply by 69" name="MUL_69" value="0x44" />
         <value caption="Multiply by 68" name="MUL_68" value="0x43" />
         <value caption="Multiply by 67" name="MUL_67" value="0x42" />
         <value caption="Multiply by 66" name="MUL_66" value="0x41" />
         <value caption="Multiply by 65" name="MUL_65" value="0x40" />
         <value caption="Multiply by 64" name="MUL_64" value="0x3f" />
         <value caption="Multiply by 63" name="MUL_63" value="0x3e" />
         <value caption="Multiply by 62" name="MUL_62" value="0x3d" />
         <value caption="Multiply by 61" name="MUL_61" value="0x3c" />
         <value caption="Multiply by 60" name="MUL_60" value="0x3b" />
         <value caption="Multiply by 59" name="MUL_59" value="0x3a" />
         <value caption="Multiply by 58" name="MUL_58" value="0x39" />
         <value caption="Multiply by 57" name="MUL_57" value="0x38" />
         <value caption="Multiply by 56" name="MUL_56" value="0x37" />
         <value caption="Multiply by 55" name="MUL_55" value="0x36" />
         <value caption="Multiply by 54" name="MUL_54" value="0x35" />
         <value caption="Multiply by 53" name="MUL_53" value="0x34" />
         <value caption="Multiply by 52" name="MUL_52" value="0x33" />
         <value caption="Multiply by 51" name="MUL_51" value="0x32" />
         <value caption="Multiply by 50" name="MUL_50" value="0x31" />
         <value caption="Multiply by 49" name="MUL_49" value="0x30" />
         <value caption="Multiply by 48" name="MUL_48" value="0x2f" />
         <value caption="Multiply by 47" name="MUL_47" value="0x2e" />
         <value caption="Multiply by 46" name="MUL_46" value="0x2d" />
         <value caption="Multiply by 45" name="MUL_45" value="0x2c" />
         <value caption="Multiply by 44" name="MUL_44" value="0x2b" />
         <value caption="Multiply by 43" name="MUL_43" value="0x2a" />
         <value caption="Multiply by 42" name="MUL_42" value="0x29" />
         <value caption="Multiply by 41" name="MUL_41" value="0x28" />
         <value caption="Multiply by 40" name="MUL_40" value="0x27" />
         <value caption="Multiply by 39" name="MUL_39" value="0x26" />
         <value caption="Multiply by 38" name="MUL_38" value="0x25" />
         <value caption="Multiply by 37" name="MUL_37" value="0x24" />
         <value caption="Multiply by 36" name="MUL_36" value="0x23" />
         <value caption="Multiply by 35" name="MUL_35" value="0x22" />
         <value caption="Multiply by 34" name="MUL_34" value="0x21" />
         <value caption="Multiply by 33" name="MUL_33" value="0x20" />
         <value caption="Multiply by 32" name="MUL_32" value="0x1f" />
         <value caption="Multiply by 31" name="MUL_31" value="0x1e" />
         <value caption="Multiply by 30" name="MUL_30" value="0x1d" />
         <value caption="Multiply by 29" name="MUL_29" value="0x1c" />
         <value caption="Multiply by 28" name="MUL_28" value="0x1b" />
         <value caption="Multiply by 27" name="MUL_27" value="0x1a" />
         <value caption="Multiply by 26" name="MUL_26" value="0x19" />
         <value caption="Multiply by 25" name="MUL_25" value="0x18" />
         <value caption="Multiply by 24" name="MUL_24" value="0x17" />
         <value caption="Multiply by 23" name="MUL_23" value="0x16" />
         <value caption="Multiply by 22" name="MUL_22" value="0x15" />
         <value caption="Multiply by 21" name="MUL_21" value="0x14" />
         <value caption="Multiply by 20" name="MUL_20" value="0x13" />
         <value caption="Multiply by 19" name="MUL_19" value="0x12" />
         <value caption="Multiply by 18" name="MUL_18" value="0x11" />
         <value caption="Multiply by 17" name="MUL_17" value="0x10" />
         <value caption="Multiply by 16" name="MUL_16" value="0x0f" />
         <value caption="Multiply by 15" name="MUL_15" value="0x0e" />
         <value caption="Multiply by 14" name="MUL_14" value="0x0d" />
         <value caption="Multiply by 13" name="MUL_13" value="0x0c" />
         <value caption="Multiply by 12" name="MUL_12" value="0x0b" />
         <value caption="Multiply by 11" name="MUL_11" value="0x0a" />
         <value caption="Multiply by 10" name="MUL_10" value="0x09" />
         <value caption="Multiply by 9" name="MUL_9" value="0x08" />
         <value caption="Multiply by 8" name="MUL_8" value="0x07" />
         <value caption="Multiply by 7" name="MUL_7" value="0x06" />
         <value caption="Multiply by 6" name="MUL_6" value="0x05" />
         <value caption="Multiply by 5" name="MUL_5" value="0x04" />
         <value caption="Multiply by 4" name="MUL_4" value="0x03" />
         <value caption="Multiply by 3" name="MUL_3" value="0x02" />
         <value caption="Multiply by 2" name="MUL_2" value="0x01" />
         <value caption="Multiply by 1" name="MUL_1" value="0x00" />
      </value-group>
      <value-group caption="System PLL Output Clock Divider bits" name="SPLLCON__PLLODIV">
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="Reserved" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO1CON__ROSEL">
         <value caption="Reference Clock Input REFCLKI" name="REFCLKI" value="0x8" />
         <value caption="System PLL Output SPLL" name="SPLL" value="0x7" />
         <value caption="Secondary Oscillator SOSC" name="Sosc" value="0x5" />
         <value caption="Low Power Oscillator LPRC" name="LPRC" value="0x4" />
         <value caption="Internal Fast Oscillator FRC" name="FRC" value="0x3" />
         <value caption="Primary Oscillator POSC" name="Posc" value="0x2" />
         <value caption="Peripheral Clock 1 PBCLK1" name="PBCLK1" value="0x1" />
         <value caption="System clock SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO1CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO1CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO1CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
