Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
      <value-group caption="Bad STEP1/2 Value Detect bits" name="DMTSTAT__BAD">
         <value caption="Incorrect STEP1 value was detected/Incorrect STEP2 value was detected" name="" value="0x3" />
         <value caption="Incorrect STEP1 value was detected/Incorrect STEP2 value was not detected" name="" value="0x2" />
         <value caption="Incorrect STEP1 value was not detected/Incorrect STEP2 value was detected" name="" value="0x1" />
         <value caption="Incorrect STEP1 value was not detected/Incorrect STEP2 value was not detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Bad STEP1 Value Detect bit" name="DMTSTAT__BAD1">
         <value caption="Incorrect STEP1 value was detected" name="" value="0x1" />
         <value caption="Incorrect STEP1 value was not detected" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01475" name="DSCTRL" version="2">
      <register-group name="DSCTRL">
         <register caption="Deep Sleep Control Register" name="DSCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="I/O Pin State Release bit" mask="0x00000001" name="RELEASE" values="DSCON__RELEASE" />
            <bitfield caption="Deep Sleep BOR Event Status bit" mask="0x00000002" name="DSBOR" values="DSCON__DSBOR" />
            <bitfield caption="RTCC Wake-up Disable bit" mask="0x00000100" name="RTCCWDIS" values="DSCON__RTCCWDIS" />
            <bitfield caption="RTCC Module Disable bit" mask="0x00001000" name="RTCDIS" values="DSCON__RTCDIS" />
            <bitfield caption="General Purpose Registers Enable bit" mask="0x00002000" name="DSGPREN" values="DSCON__DSGPREN" />
            <bitfield caption="Deep Sleep Enable bit" mask="0x00008000" name="DSEN" values="DSCON__DSEN" />
         </register>
         <register caption="Deep Sleep Wake-up Source Register" name="DSWAKE" offset="0x4" rw="RW" size="4">
            <bitfield caption="MCLR Event bit" mask="0x00000004" name="DSMCLR" values="DSWAKE__DSMCLR" />
            <bitfield caption="Real-Time Clock and Calendar Alarm bit" mask="0x00000008" name="DSRTC" values="DSWAKE__DSRTC" />
            <bitfield caption="Deep Sleep Watchdog Timer Time-out bit" mask="0x00000010" name="DSWDT" values="DSWAKE__DSWDT" />
            <bitfield caption="Deep Sleep Fault Detected bit" mask="0x00000080" name="DSFLT" values="DSWAKE__DSFLT" />
            <bitfield caption="Interrupt-on-Change bit" mask="0x00000100" name="DSINT0" values="DSWAKE__DSINT0" />
         </register>
         <register caption="" name="DSGPR0" offset="0x8" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR1" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR2" offset="0x14" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR3" offset="0x18" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR4" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR5" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR6" offset="0x24" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR7" offset="0x28" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR8" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR9" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR10" offset="0x34" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR11" offset="0x38" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR12" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR13" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR14" offset="0x44" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR15" offset="0x48" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR16" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR17" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR18" offset="0x54" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR19" offset="0x58" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR20" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR21" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR22" offset="0x64" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR23" offset="0x68" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR24" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR25" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
         <register caption="" name="DSGPR26" offset="0x74" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DSGPR" />
         </register>
