Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
         <register caption="" name="SRCON1B" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1B" />
            <bitfield mask="0x00000002" name="SRCON1B" />
            <bitfield mask="0x00000004" name="SRCON1B" />
            <bitfield mask="0x00000008" name="SRCON1B" />
            <bitfield mask="0x00000010" name="SRCON1B" />
            <bitfield mask="0x00000020" name="SRCON1B" />
            <bitfield mask="0x00000040" name="SRCON1B" />
            <bitfield mask="0x00000080" name="SRCON1B" />
            <bitfield mask="0x00000100" name="SRCON1B" />
            <bitfield mask="0x00000200" name="SRCON1B" />
            <bitfield mask="0x00000400" name="SRCON1B" />
            <bitfield mask="0x00000800" name="SRCON1B" />
            <bitfield mask="0x00001000" name="SRCON1B" />
            <bitfield mask="0x00002000" name="SRCON1B" />
            <bitfield mask="0x00004000" name="SRCON1B" />
            <bitfield mask="0x00008000" name="SRCON1B" />
         </register>
         <register caption="" name="SRCON1C" offset="0x2d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1C" />
            <bitfield mask="0x00000002" name="SRCON1C" />
            <bitfield mask="0x00000004" name="SRCON1C" />
            <bitfield mask="0x00000008" name="SRCON1C" />
            <bitfield mask="0x00000010" name="SRCON1C" />
            <bitfield mask="0x00000020" name="SRCON1C" />
            <bitfield mask="0x00000040" name="SRCON1C" />
            <bitfield mask="0x00000080" name="SRCON1C" />
            <bitfield mask="0x00000100" name="SRCON1C" />
            <bitfield mask="0x00000200" name="SRCON1C" />
            <bitfield mask="0x00000400" name="SRCON1C" />
            <bitfield mask="0x00000800" name="SRCON1C" />
            <bitfield mask="0x00001000" name="SRCON1C" />
            <bitfield mask="0x00002000" name="SRCON1C" />
            <bitfield mask="0x00004000" name="SRCON1C" />
            <bitfield mask="0x00008000" name="SRCON1C" />
         </register>
         <register caption="" name="SRCON1D" offset="0x3d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1D" />
            <bitfield mask="0x00000002" name="SRCON1D" />
            <bitfield mask="0x00000004" name="SRCON1D" />
            <bitfield mask="0x00000008" name="SRCON1D" />
            <bitfield mask="0x00000010" name="SRCON1D" />
            <bitfield mask="0x00000020" name="SRCON1D" />
            <bitfield mask="0x00000040" name="SRCON1D" />
            <bitfield mask="0x00000080" name="SRCON1D" />
            <bitfield mask="0x00000100" name="SRCON1D" />
            <bitfield mask="0x00000200" name="SRCON1D" />
            <bitfield mask="0x00000400" name="SRCON1D" />
            <bitfield mask="0x00000800" name="SRCON1D" />
            <bitfield mask="0x00001000" name="SRCON1D" />
            <bitfield mask="0x00002000" name="SRCON1D" />
            <bitfield mask="0x00004000" name="SRCON1D" />
            <bitfield mask="0x00008000" name="SRCON1D" />
         </register>
         <register caption="" name="SRCON1E" offset="0x4d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1E" />
            <bitfield mask="0x00000002" name="SRCON1E" />
            <bitfield mask="0x00000004" name="SRCON1E" />
            <bitfield mask="0x00000008" name="SRCON1E" />
            <bitfield mask="0x00000010" name="SRCON1E" />
            <bitfield mask="0x00000020" name="SRCON1E" />
            <bitfield mask="0x00000040" name="SRCON1E" />
            <bitfield mask="0x00000080" name="SRCON1E" />
            <bitfield mask="0x00000100" name="SRCON1E" />
            <bitfield mask="0x00000200" name="SRCON1E" />
            <bitfield mask="0x00000400" name="SRCON1E" />
            <bitfield mask="0x00000800" name="SRCON1E" />
            <bitfield mask="0x00001000" name="SRCON1E" />
            <bitfield mask="0x00002000" name="SRCON1E" />
            <bitfield mask="0x00004000" name="SRCON1E" />
            <bitfield mask="0x00008000" name="SRCON1E" />
         </register>
         <register caption="" name="SRCON1F" offset="0x5d0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="SRCON1F" />
            <bitfield mask="0x00000002" name="SRCON1F" />
            <bitfield mask="0x00000004" name="SRCON1F" />
            <bitfield mask="0x00000008" name="SRCON1F" />
            <bitfield mask="0x00000010" name="SRCON1F" />
            <bitfield mask="0x00000020" name="SRCON1F" />
            <bitfield mask="0x00000040" name="SRCON1F" />
            <bitfield mask="0x00000080" name="SRCON1F" />
            <bitfield mask="0x00000100" name="SRCON1F" />
            <bitfield mask="0x00000200" name="SRCON1F" />
            <bitfield mask="0x00000400" name="SRCON1F" />
            <bitfield mask="0x00000800" name="SRCON1F" />
            <bitfield mask="0x00001000" name="SRCON1F" />
            <bitfield mask="0x00002000" name="SRCON1F" />
            <bitfield mask="0x00004000" name="SRCON1F" />
            <bitfield mask="0x00008000" name="SRCON1F" />
         </register>
      </register-group>
      <value-group caption="Change Notification Style bit" name="CNCONA__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONA__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONB__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONB__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notification Style bit" name="CNCONC__EDGEDETECT">
         <value caption="Edge Style. Detect edge transitions (CNFx used for CN Event)." name="" value="0x1" />
         <value caption="Mismatch Style. Detect change from last PORTx read (CNSTATx used for CN Event)." name="" value="0x0" />
      </value-group>
      <value-group caption="Change Notice Control ON bit" name="CNCONC__ON">
         <value caption="CN is enabled" name="" value="0x1" />
         <value caption="CN is disabled" name="" value="0x0" />
      </value-group>
