Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
         <register caption="Priority Shadow Select Register" name="PRISS" offset="0x10" rw="RW" size="4">
            <bitfield caption="Single Vector Shadow Register Set bit" mask="0x00000001" name="SS0" values="PRISS__SS0" />
            <bitfield caption="Interrupt with Priority Level 1 Shadow Set bits" mask="0x000000F0" name="PRI1SS" values="PRISS__PRI1SS" />
            <bitfield caption="Interrupt with Priority Level 2 Shadow Set bits" mask="0x00000F00" name="PRI2SS" values="PRISS__PRI2SS" />
            <bitfield caption="Interrupt with Priority Level 3 Shadow Set bits" mask="0x0000F000" name="PRI3SS" values="PRISS__PRI3SS" />
            <bitfield caption="Interrupt with Priority Level 4 Shadow Set bits" mask="0x000F0000" name="PRI4SS" values="PRISS__PRI4SS" />
            <bitfield caption="Interrupt with Priority Level 5 Shadow Set bits" mask="0x00F00000" name="PRI5SS" values="PRISS__PRI5SS" />
            <bitfield caption="Interrupt with Priority Level 6 Shadow Set bits" mask="0x0F000000" name="PRI6SS" values="PRISS__PRI6SS" />
            <bitfield caption="Interrupt with Priority Level 7 Shadow Set bits" mask="0xF0000000" name="PRI7SS" values="PRISS__PRI7SS" />
         </register>
         <register caption="Interrupt Status Register" name="INTSTAT" offset="0x20" rw="R" size="4">
            <bitfield mask="0x000000FF" name="SIRQ" />
            <bitfield mask="0x00000700" name="SRIPL" />
         </register>
         <register caption="Interrupt Proximity Timer Register" name="IPTMR" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="IPTMR" />
         </register>
         <register caption="" name="IFS0" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIF" />
            <bitfield mask="0x00000002" name="CS0IF" />
            <bitfield mask="0x00000004" name="CS1IF" />
            <bitfield mask="0x00000008" name="INT0IF" />
            <bitfield mask="0x00000010" name="T1IF" />
            <bitfield mask="0x00000020" name="IC1EIF" />
            <bitfield mask="0x00000040" name="IC1IF" />
            <bitfield mask="0x00000080" name="OC1IF" />
            <bitfield mask="0x00000100" name="INT1IF" />
            <bitfield mask="0x00000200" name="T2IF" />
            <bitfield mask="0x00000400" name="IC2EIF" />
            <bitfield mask="0x00000800" name="IC2IF" />
            <bitfield mask="0x00001000" name="OC2IF" />
            <bitfield mask="0x00002000" name="INT2IF" />
            <bitfield mask="0x00004000" name="T3IF" />
            <bitfield mask="0x00008000" name="IC3EIF" />
            <bitfield mask="0x00010000" name="IC3IF" />
            <bitfield mask="0x00020000" name="OC3IF" />
            <bitfield mask="0x00040000" name="INT3IF" />
            <bitfield mask="0x00080000" name="T4IF" />
            <bitfield mask="0x00100000" name="IC4EIF" />
            <bitfield mask="0x00200000" name="IC4IF" />
            <bitfield mask="0x00400000" name="OC4IF" />
            <bitfield mask="0x00800000" name="INT4IF" />
            <bitfield mask="0x01000000" name="T5IF" />
            <bitfield mask="0x02000000" name="IC5EIF" />
            <bitfield mask="0x04000000" name="IC5IF" />
            <bitfield mask="0x08000000" name="OC5IF" />
            <bitfield mask="0x40000000" name="RTCCIF" />
            <bitfield mask="0x80000000" name="FCEIF" />
         </register>
         <register caption="" name="IFS1" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1IF" />
            <bitfield mask="0x00000002" name="CMP2IF" />
            <bitfield mask="0x00000008" name="SPI1EIF" />
            <bitfield mask="0x00000010" name="SPI1RXIF" />
            <bitfield mask="0x00000020" name="SPI1TXIF" />
            <bitfield mask="0x00000040" name="U1EIF" />
            <bitfield mask="0x00000080" name="U1RXIF" />
            <bitfield mask="0x00000100" name="U1TXIF" />
            <bitfield mask="0x00000200" name="I2C1BIF" />
            <bitfield mask="0x00000400" name="I2C1SIF" />
            <bitfield mask="0x00000800" name="I2C1MIF" />
            <bitfield mask="0x00001000" name="CNAIF" />
            <bitfield mask="0x00002000" name="CNBIF" />
            <bitfield mask="0x00004000" name="CNCIF" />
            <bitfield mask="0x00008000" name="CNDIF" />
            <bitfield mask="0x00010000" name="CNEIF" />
            <bitfield mask="0x00020000" name="CNFIF" />
            <bitfield mask="0x00040000" name="CNGIF" />
            <bitfield mask="0x00200000" name="SPI2EIF" />
            <bitfield mask="0x00400000" name="SPI2RXIF" />
            <bitfield mask="0x00800000" name="SPI2TXIF" />
            <bitfield mask="0x01000000" name="U2EIF" />
            <bitfield mask="0x02000000" name="U2RXIF" />
            <bitfield mask="0x04000000" name="U2TXIF" />
            <bitfield mask="0x08000000" name="I2C2BIF" />
            <bitfield mask="0x10000000" name="I2C2SIF" />
            <bitfield mask="0x20000000" name="I2C2MIF" />
         </register>
         <register caption="" name="IFS2" offset="0x60" rw="RW" size="4">
            <bitfield mask="0x00000080" name="CTMUIF" />
            <bitfield mask="0x00000100" name="DMA0IF" />
            <bitfield mask="0x00000200" name="DMA1IF" />
            <bitfield mask="0x00000400" name="DMA2IF" />
            <bitfield mask="0x00000800" name="DMA3IF" />
            <bitfield mask="0x00001000" name="T6IF" />
            <bitfield mask="0x00002000" name="IC6EIF" />
            <bitfield mask="0x00004000" name="IC6IF" />
            <bitfield mask="0x00008000" name="OC6IF" />
            <bitfield mask="0x00010000" name="T7IF" />
            <bitfield mask="0x00020000" name="IC7EIF" />
            <bitfield mask="0x00040000" name="IC7IF" />
            <bitfield mask="0x00080000" name="OC7IF" />
            <bitfield mask="0x00100000" name="T8IF" />
            <bitfield mask="0x00200000" name="IC8EIF" />
            <bitfield mask="0x00400000" name="IC8IF" />
            <bitfield mask="0x00800000" name="OC8IF" />
            <bitfield mask="0x01000000" name="T9IF" />
            <bitfield mask="0x02000000" name="IC9EIF" />
            <bitfield mask="0x04000000" name="IC9IF" />
            <bitfield mask="0x08000000" name="OC9IF" />
            <bitfield mask="0x10000000" name="AD1IF" />
            <bitfield mask="0x40000000" name="AD1DC1IF" />
            <bitfield mask="0x80000000" name="AD1DC2IF" />
         </register>
         <register caption="" name="IFS3" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1DF1IF" />
            <bitfield mask="0x00000002" name="AD1DF2IF" />
            <bitfield mask="0x00000004" name="AD1DF3IF" />
            <bitfield mask="0x00000008" name="AD1DF4IF" />
            <bitfield mask="0x00000010" name="AD1FIIF" />
            <bitfield mask="0x00000020" name="AD1EOSIF" />
            <bitfield mask="0x00000040" name="AD1ARIF" />
            <bitfield mask="0x00000080" name="AD1RSIF" />
            <bitfield mask="0x00000100" name="AD1FCBTIF" />
            <bitfield mask="0x00000200" name="AD1GIF" />
            <bitfield mask="0x00000400" name="AD1D0IF" />
            <bitfield mask="0x00000800" name="AD1D1IF" />
            <bitfield mask="0x00001000" name="AD1D2IF" />
            <bitfield mask="0x00002000" name="AD1D3IF" />
            <bitfield mask="0x00004000" name="AD1D4IF" />
            <bitfield mask="0x00008000" name="AD1D5IF" />
            <bitfield mask="0x00010000" name="AD1D6IF" />
            <bitfield mask="0x00020000" name="AD1D7IF" />
            <bitfield mask="0x00040000" name="AD1D8IF" />
            <bitfield mask="0x00080000" name="AD1D9IF" />
            <bitfield mask="0x00100000" name="AD1D10IF" />
            <bitfield mask="0x00200000" name="AD1D11IF" />
            <bitfield mask="0x00400000" name="AD1D12IF" />
            <bitfield mask="0x00800000" name="AD1D13IF" />
            <bitfield mask="0x01000000" name="AD1D14IF" />
            <bitfield mask="0x02000000" name="AD1D15IF" />
            <bitfield mask="0x04000000" name="AD1D16IF" />
            <bitfield mask="0x08000000" name="AD1D17IF" />
            <bitfield mask="0x10000000" name="AD1D18IF" />
            <bitfield mask="0x20000000" name="AD1D19IF" />
         </register>
         <register caption="" name="IFS4" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00000004" name="AD1D24IF" />
            <bitfield mask="0x00000008" name="AD1D25IF" />
            <bitfield mask="0x00000010" name="AD1D26IF" />
            <bitfield mask="0x00000020" name="AD1D27IF" />
            <bitfield mask="0x00040000" name="AD1D40IF" />
            <bitfield mask="0x00080000" name="AD1D41IF" />
            <bitfield mask="0x01000000" name="AD1D46IF" />
            <bitfield mask="0x02000000" name="AD1D47IF" />
            <bitfield mask="0x04000000" name="AD1D48IF" />
            <bitfield mask="0x08000000" name="AD1D49IF" />
            <bitfield mask="0x10000000" name="AD1D50IF" />
            <bitfield mask="0x20000000" name="AD1D51IF" />
            <bitfield mask="0x40000000" name="AD1D52IF" />
            <bitfield mask="0x80000000" name="AD1D53IF" />
         </register>
         <register caption="" name="IFS5" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP3IF" />
            <bitfield mask="0x00000002" name="CMP4IF" />
            <bitfield mask="0x00000004" name="CMP5IF" />
            <bitfield mask="0x00000080" name="CAN1IF" />
            <bitfield mask="0x00000200" name="QEI1IF" />
            <bitfield mask="0x00000400" name="QEI2IF" />
            <bitfield mask="0x00000800" name="PWMPEVTIF" />
            <bitfield mask="0x00001000" name="PWMSEVTIF" />
            <bitfield mask="0x00002000" name="PWM1IF" />
            <bitfield mask="0x00004000" name="PWM2IF" />
            <bitfield mask="0x00008000" name="PWM3IF" />
            <bitfield mask="0x00010000" name="PWM4IF" />
            <bitfield mask="0x00020000" name="PWM5IF" />
            <bitfield mask="0x00040000" name="PWM6IF" />
            <bitfield mask="0x00400000" name="DMA4IF" />
            <bitfield mask="0x00800000" name="DMA5IF" />
            <bitfield mask="0x01000000" name="DMA6IF" />
            <bitfield mask="0x02000000" name="DMA7IF" />
            <bitfield mask="0x20000000" name="QEI3IF" />
         </register>
