Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
         <register caption="" name="IFS7" offset="0x0B0" rw="RW" size="4">
            <bitfield mask="0x00000040" name="SBIF" />
            <bitfield mask="0x00004000" name="PWM7IF" />
            <bitfield mask="0x00008000" name="PWM8IF" />
            <bitfield mask="0x00010000" name="PWM9IF" />
            <bitfield mask="0x00200000" name="AD1DC3IF" />
            <bitfield mask="0x00400000" name="AD1DC4IF" />
            <bitfield mask="0x00800000" name="PCACHEIF" />
            <bitfield mask="0x02000000" name="CLC1IF" />
            <bitfield mask="0x04000000" name="CLC2IF" />
            <bitfield mask="0x08000000" name="CLC3IF" />
            <bitfield mask="0x10000000" name="CLC4IF" />
            <bitfield mask="0x40000000" name="CPCIF" />
            <bitfield mask="0x80000000" name="CFDCIF" />
         </register>
         <register caption="" name="IEC0" offset="0x0C0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CTIE" />
            <bitfield mask="0x00000002" name="CS0IE" />
            <bitfield mask="0x00000004" name="CS1IE" />
            <bitfield mask="0x00000008" name="INT0IE" />
            <bitfield mask="0x00000010" name="T1IE" />
            <bitfield mask="0x00000020" name="IC1EIE" />
            <bitfield mask="0x00000040" name="IC1IE" />
            <bitfield mask="0x00000080" name="OC1IE" />
            <bitfield mask="0x00000100" name="INT1IE" />
            <bitfield mask="0x00000200" name="T2IE" />
            <bitfield mask="0x00000400" name="IC2EIE" />
            <bitfield mask="0x00000800" name="IC2IE" />
            <bitfield mask="0x00001000" name="OC2IE" />
            <bitfield mask="0x00002000" name="INT2IE" />
            <bitfield mask="0x00004000" name="T3IE" />
            <bitfield mask="0x00008000" name="IC3EIE" />
            <bitfield mask="0x00010000" name="IC3IE" />
            <bitfield mask="0x00020000" name="OC3IE" />
            <bitfield mask="0x00040000" name="INT3IE" />
            <bitfield mask="0x00080000" name="T4IE" />
            <bitfield mask="0x00100000" name="IC4EIE" />
            <bitfield mask="0x00200000" name="IC4IE" />
            <bitfield mask="0x00400000" name="OC4IE" />
            <bitfield mask="0x00800000" name="INT4IE" />
            <bitfield mask="0x01000000" name="T5IE" />
            <bitfield mask="0x02000000" name="IC5EIE" />
            <bitfield mask="0x04000000" name="IC5IE" />
            <bitfield mask="0x08000000" name="OC5IE" />
            <bitfield mask="0x40000000" name="RTCCIE" />
            <bitfield mask="0x80000000" name="FCEIE" />
         </register>
         <register caption="" name="IEC1" offset="0x0D0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP1IE" />
            <bitfield mask="0x00000002" name="CMP2IE" />
            <bitfield mask="0x00000008" name="SPI1EIE" />
            <bitfield mask="0x00000010" name="SPI1RXIE" />
            <bitfield mask="0x00000020" name="SPI1TXIE" />
            <bitfield mask="0x00000040" name="U1EIE" />
            <bitfield mask="0x00000080" name="U1RXIE" />
            <bitfield mask="0x00000100" name="U1TXIE" />
            <bitfield mask="0x00000200" name="I2C1BIE" />
            <bitfield mask="0x00000400" name="I2C1SIE" />
            <bitfield mask="0x00000800" name="I2C1MIE" />
            <bitfield mask="0x00001000" name="CNAIE" />
            <bitfield mask="0x00002000" name="CNBIE" />
            <bitfield mask="0x00004000" name="CNCIE" />
            <bitfield mask="0x00008000" name="CNDIE" />
            <bitfield mask="0x00010000" name="CNEIE" />
            <bitfield mask="0x00020000" name="CNFIE" />
            <bitfield mask="0x00040000" name="CNGIE" />
            <bitfield mask="0x00200000" name="SPI2EIE" />
            <bitfield mask="0x00400000" name="SPI2RXIE" />
            <bitfield mask="0x00800000" name="SPI2TXIE" />
            <bitfield mask="0x01000000" name="U2EIE" />
            <bitfield mask="0x02000000" name="U2RXIE" />
            <bitfield mask="0x04000000" name="U2TXIE" />
            <bitfield mask="0x08000000" name="I2C2BIE" />
            <bitfield mask="0x10000000" name="I2C2SIE" />
            <bitfield mask="0x20000000" name="I2C2MIE" />
         </register>
         <register caption="" name="IEC2" offset="0x0E0" rw="RW" size="4">
            <bitfield mask="0x00000080" name="CTMUIE" />
            <bitfield mask="0x00000100" name="DMA0IE" />
            <bitfield mask="0x00000200" name="DMA1IE" />
            <bitfield mask="0x00000400" name="DMA2IE" />
            <bitfield mask="0x00000800" name="DMA3IE" />
            <bitfield mask="0x00001000" name="T6IE" />
            <bitfield mask="0x00002000" name="IC6EIE" />
            <bitfield mask="0x00004000" name="IC6IE" />
            <bitfield mask="0x00008000" name="OC6IE" />
            <bitfield mask="0x00010000" name="T7IE" />
            <bitfield mask="0x00020000" name="IC7EIE" />
            <bitfield mask="0x00040000" name="IC7IE" />
            <bitfield mask="0x00080000" name="OC7IE" />
            <bitfield mask="0x00100000" name="T8IE" />
            <bitfield mask="0x00200000" name="IC8EIE" />
            <bitfield mask="0x00400000" name="IC8IE" />
            <bitfield mask="0x00800000" name="OC8IE" />
            <bitfield mask="0x01000000" name="T9IE" />
            <bitfield mask="0x02000000" name="IC9EIE" />
            <bitfield mask="0x04000000" name="IC9IE" />
            <bitfield mask="0x08000000" name="OC9IE" />
            <bitfield mask="0x10000000" name="AD1IE" />
            <bitfield mask="0x40000000" name="AD1DC1IE" />
            <bitfield mask="0x80000000" name="AD1DC2IE" />
         </register>
         <register caption="" name="IEC3" offset="0x0F0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="AD1DF1IE" />
            <bitfield mask="0x00000002" name="AD1DF2IE" />
            <bitfield mask="0x00000004" name="AD1DF3IE" />
            <bitfield mask="0x00000008" name="AD1DF4IE" />
            <bitfield mask="0x00000010" name="AD1FIIE" />
            <bitfield mask="0x00000020" name="AD1EOSIE" />
            <bitfield mask="0x00000040" name="AD1ARIE" />
            <bitfield mask="0x00000080" name="AD1RSIE" />
            <bitfield mask="0x00000100" name="AD1FCBTIE" />
            <bitfield mask="0x00000200" name="AD1GIE" />
            <bitfield mask="0x00000400" name="AD1D0IE" />
            <bitfield mask="0x00000800" name="AD1D1IE" />
            <bitfield mask="0x00001000" name="AD1D2IE" />
            <bitfield mask="0x00002000" name="AD1D3IE" />
            <bitfield mask="0x00004000" name="AD1D4IE" />
            <bitfield mask="0x00008000" name="AD1D5IE" />
            <bitfield mask="0x00010000" name="AD1D6IE" />
            <bitfield mask="0x00020000" name="AD1D7IE" />
            <bitfield mask="0x00040000" name="AD1D8IE" />
            <bitfield mask="0x00080000" name="AD1D9IE" />
            <bitfield mask="0x00100000" name="AD1D10IE" />
            <bitfield mask="0x00200000" name="AD1D11IE" />
            <bitfield mask="0x00400000" name="AD1D12IE" />
            <bitfield mask="0x00800000" name="AD1D13IE" />
            <bitfield mask="0x01000000" name="AD1D14IE" />
            <bitfield mask="0x02000000" name="AD1D15IE" />
            <bitfield mask="0x04000000" name="AD1D16IE" />
            <bitfield mask="0x08000000" name="AD1D17IE" />
            <bitfield mask="0x10000000" name="AD1D18IE" />
            <bitfield mask="0x20000000" name="AD1D19IE" />
         </register>
         <register caption="" name="IEC4" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x00000004" name="AD1D24IE" />
            <bitfield mask="0x00000008" name="AD1D25IE" />
            <bitfield mask="0x00000010" name="AD1D26IE" />
            <bitfield mask="0x00000020" name="AD1D27IE" />
            <bitfield mask="0x00000800" name="AD1D33IE" />
            <bitfield mask="0x00001000" name="AD1D34IE" />
            <bitfield mask="0x00002000" name="AD1D35IE" />
            <bitfield mask="0x00004000" name="AD1D36IE" />
            <bitfield mask="0x00008000" name="AD1D37IE" />
            <bitfield mask="0x00010000" name="AD1D38IE" />
            <bitfield mask="0x00020000" name="AD1D39IE" />
            <bitfield mask="0x00040000" name="AD1D40IE" />
            <bitfield mask="0x00080000" name="AD1D41IE" />
            <bitfield mask="0x01000000" name="AD1D46IE" />
            <bitfield mask="0x02000000" name="AD1D47IE" />
            <bitfield mask="0x04000000" name="AD1D48IE" />
            <bitfield mask="0x08000000" name="AD1D49IE" />
            <bitfield mask="0x10000000" name="AD1D50IE" />
            <bitfield mask="0x20000000" name="AD1D51IE" />
            <bitfield mask="0x40000000" name="AD1D52IE" />
            <bitfield mask="0x80000000" name="AD1D53IE" />
         </register>
         <register caption="" name="IEC5" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CMP3IE" />
            <bitfield mask="0x00000002" name="CMP4IE" />
            <bitfield mask="0x00000004" name="CMP5IE" />
            <bitfield mask="0x00000080" name="CAN1IE" />
            <bitfield mask="0x00000200" name="QEI1IE" />
            <bitfield mask="0x00000400" name="QEI2IE" />
            <bitfield mask="0x00000800" name="PWMPEVTIE" />
            <bitfield mask="0x00001000" name="PWMSEVTIE" />
            <bitfield mask="0x00002000" name="PWM1IE" />
            <bitfield mask="0x00004000" name="PWM2IE" />
            <bitfield mask="0x00008000" name="PWM3IE" />
            <bitfield mask="0x00010000" name="PWM4IE" />
            <bitfield mask="0x00020000" name="PWM5IE" />
            <bitfield mask="0x00040000" name="PWM6IE" />
            <bitfield mask="0x00400000" name="DMA4IE" />
            <bitfield mask="0x00800000" name="DMA5IE" />
            <bitfield mask="0x01000000" name="DMA6IE" />
            <bitfield mask="0x02000000" name="DMA7IE" />
            <bitfield mask="0x20000000" name="QEI3IE" />
         </register>
         <register caption="" name="IEC7" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000040" name="SBIE" />
            <bitfield mask="0x00004000" name="PWM7IE" />
            <bitfield mask="0x00008000" name="PWM8IE" />
            <bitfield mask="0x00010000" name="PWM9IE" />
            <bitfield mask="0x00200000" name="AD1DC3IE" />
            <bitfield mask="0x00400000" name="AD1DC4IE" />
            <bitfield mask="0x00800000" name="PCACHEIE" />
            <bitfield mask="0x02000000" name="CLC1IE" />
            <bitfield mask="0x04000000" name="CLC2IE" />
            <bitfield mask="0x08000000" name="CLC3IE" />
            <bitfield mask="0x10000000" name="CLC4IE" />
            <bitfield mask="0x40000000" name="CPCIE" />
            <bitfield mask="0x80000000" name="CFDCIE" />
         </register>
         <register caption="" name="IPC0" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CTIS" />
            <bitfield mask="0x0000001C" name="CTIP" />
            <bitfield mask="0x00000300" name="CS0IS" />
            <bitfield mask="0x00001C00" name="CS0IP" />
            <bitfield mask="0x00030000" name="CS1IS" />
            <bitfield mask="0x001C0000" name="CS1IP" />
            <bitfield mask="0x03000000" name="INT0IS" />
            <bitfield mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="" name="IPC1" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T1IS" />
            <bitfield mask="0x0000001C" name="T1IP" />
            <bitfield mask="0x00000300" name="IC1EIS" />
            <bitfield mask="0x00001C00" name="IC1EIP" />
            <bitfield mask="0x00030000" name="IC1IS" />
            <bitfield mask="0x001C0000" name="IC1IP" />
            <bitfield mask="0x03000000" name="OC1IS" />
            <bitfield mask="0x1C000000" name="OC1IP" />
         </register>
         <register caption="" name="IPC2" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000003" name="INT1IS" />
            <bitfield mask="0x0000001C" name="INT1IP" />
            <bitfield mask="0x00000300" name="T2IS" />
            <bitfield mask="0x00001C00" name="T2IP" />
            <bitfield mask="0x00030000" name="IC2EIS" />
            <bitfield mask="0x001C0000" name="IC2EIP" />
            <bitfield mask="0x03000000" name="IC2IS" />
            <bitfield mask="0x1C000000" name="IC2IP" />
         </register>
         <register caption="" name="IPC3" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00000003" name="OC2IS" />
            <bitfield mask="0x0000001C" name="OC2IP" />
            <bitfield mask="0x00000300" name="INT2IS" />
            <bitfield mask="0x00001C00" name="INT2IP" />
            <bitfield mask="0x00030000" name="T3IS" />
            <bitfield mask="0x001C0000" name="T3IP" />
            <bitfield mask="0x03000000" name="IC3EIS" />
            <bitfield mask="0x1C000000" name="IC3EIP" />
         </register>
         <register caption="" name="IPC4" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC3IS" />
            <bitfield mask="0x0000001C" name="IC3IP" />
            <bitfield mask="0x00000300" name="OC3IS" />
            <bitfield mask="0x00001C00" name="OC3IP" />
            <bitfield mask="0x00030000" name="INT3IS" />
            <bitfield mask="0x001C0000" name="INT3IP" />
            <bitfield mask="0x03000000" name="T4IS" />
            <bitfield mask="0x1C000000" name="T4IP" />
         </register>
