Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON8" offset="0x7c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON8__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON8__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON8__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON8__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON8__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON8__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON8__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON8__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON8__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON8__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON8__PWMLIEN" />
            <bitfield caption="Primary Trigger Interrupt Enable bit" mask="0x00200000" name="TRGIEN" values="PWMCON8__TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON8__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON8__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON8__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON8__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON8__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON8__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON8__FLTIF" />
         </register>
         <register caption="PWM Control Register x (x = 1 through 12)" name="PWMCON9" offset="0x8c0" rw="RW" size="4">
            <bitfield caption="External PWM Reset Control bit" mask="0x00000002" name="XPRES" values="PWMCON9__XPRES" />
            <bitfield caption="Master Time Base Select bit" mask="0x00000008" name="MTBS" values="PWMCON9__MTBS" />
            <bitfield caption="PWM Timer Direction bit" mask="0x00000010" name="PTDIR" values="PWMCON9__PTDIR" />
            <bitfield caption="Dead Time Compensation Polarity bit" mask="0x00000020" name="DTCP" values="PWMCON9__DTCP" />
            <bitfield caption="Dead Time Control bits" mask="0x000000C0" name="DTC" values="PWMCON9__DTC" />
            <bitfield caption="Independent Time Base Mode bit" mask="0x00000200" name="ITB" values="PWMCON9__ITB" />
            <bitfield caption="Edge/Center-Aligned Mode Enable bits" mask="0x00000C00" name="ECAM" values="PWMCON9__ECAM" />
            <bitfield caption="Current-Limit Interrupt Status bit (This bit is cleared by setting CLIEN to 0)" mask="0x00004000" name="CLTSTAT" values="PWMCON9__CLTSTAT" />
            <bitfield caption="Fault Interrupt Status bit (This bit is cleared by setting FLTIEN to 0)" mask="0x00008000" name="FLTSTAT" values="PWMCON9__FLTSTAT" />
            <bitfield caption="PWM High Phase Interrupt Enable bit" mask="0x00080000" name="PWMHIEN" values="PWMCON9__PWMHIEN" />
            <bitfield caption="PWM Low Phase Interrupt Enable bit" mask="0x00100000" name="PWMLIEN" values="PWMCON9__PWMLIEN" />
            <bitfield caption="Primary Trigger Interrupt Enable bit" mask="0x00200000" name="TRGIEN" values="PWMCON9__TRGIEN" />
            <bitfield caption="Current-Limit Interrupt Enable bit" mask="0x00400000" name="CLIEN" values="PWMCON9__CLIEN" />
            <bitfield caption="Fault Interrupt Enable bit" mask="0x00800000" name="FLTIEN" values="PWMCON9__FLTIEN" />
            <bitfield caption="PWMH Interrupt Status bit" mask="0x08000000" name="PWMHIF" values="PWMCON9__PWMHIF" />
            <bitfield caption="PWML Interrupt Status bit" mask="0x10000000" name="PWMLIF" values="PWMCON9__PWMLIF" />
            <bitfield caption="Trigger Interrupt Status bit" mask="0x20000000" name="TRGIF" values="PWMCON9__TRGIF" />
            <bitfield caption="Current-Limit Status bit" mask="0x40000000" name="CLIF" values="PWMCON9__CLIF" />
            <bitfield caption="Fault Interrupt Flag bit" mask="0x80000000" name="FLTIF" values="PWMCON9__FLTIF" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON1" offset="0xd0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON1__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON1__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield mask="0x000000C0" name="OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON1__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON1__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON1__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON1__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON1__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON1__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON1__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON1__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON1__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON1__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON1__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON1__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON1__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON2" offset="0x1d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON2__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON2__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield mask="0x000000C0" name="OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON2__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON2__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON2__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON2__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON2__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON2__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON2__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON2__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON2__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON2__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON2__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON2__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON2__CLSRC" />
         </register>
         <register caption="PWMx I/O Control Register x (x = 1 through 12)" name="IOCON3" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="Output Override Synchronization bit" mask="0x00000001" name="OSYNC" values="IOCON3__OSYNC" />
            <bitfield caption="SWAP PWMxH and PWMxL Pins bit" mask="0x00000002" name="SWAP" values="IOCON3__SWAP" />
            <bitfield mask="0x0000000C" name="CLDAT" />
            <bitfield mask="0x00000030" name="FLTDAT" />
            <bitfield mask="0x000000C0" name="OVRDAT" />
            <bitfield caption="Override Enable for PWMxL Pin bit" mask="0x00000100" name="OVRENL" values="IOCON3__OVRENL" />
            <bitfield caption="Override Enable for PWMxH Pin bit" mask="0x00000200" name="OVRENH" values="IOCON3__OVRENH" />
            <bitfield caption="PWM x I/O Pin Mode bits" mask="0x00000C00" name="PMOD" values="IOCON3__PMOD" />
            <bitfield caption="PWMxL Output Pin Polarity bit" mask="0x00001000" name="POLL" values="IOCON3__POLL" />
            <bitfield caption="PWMxH Output Pin Polarity bit" mask="0x00002000" name="POLH" values="IOCON3__POLH" />
            <bitfield caption="PWMxL Output Pin Ownership bit" mask="0x00004000" name="PENL" values="IOCON3__PENL" />
            <bitfield caption="PWMxH Output Pin Ownership bit" mask="0x00008000" name="PENH" values="IOCON3__PENH" />
            <bitfield caption="Fault Mode bits for PWM Generator x" mask="0x00030000" name="FLTMOD" values="IOCON3__FLTMOD" />
            <bitfield caption="Fault Polarity bits for PWM Generator x" mask="0x00040000" name="FLTPOL" values="IOCON3__FLTPOL" />
            <bitfield caption="Fault Control Signal Source Select bits for PWM Generator x" mask="0x00780000" name="FLTSRC" values="IOCON3__FLTSRC" />
            <bitfield caption="Current-Limit Mode Enable bit for PWM Generator x" mask="0x01000000" name="CLMOD" values="IOCON3__CLMOD" />
            <bitfield caption="Current-Limit Polarity bits for PWM Generator x" mask="0x02000000" name="CLPOL" values="IOCON3__CLPOL" />
            <bitfield caption="Current-Limit Control Signal Source select bit for PWM Generator x" mask="0x3C000000" name="CLSRC" values="IOCON3__CLSRC" />
         </register>
