Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON6" offset="0x650" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON6__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON6__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON6__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON6__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON6__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON7" offset="0x750" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON7__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON7__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON7__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON7__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON7__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON8" offset="0x850" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON8__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON8__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON8__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON8__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON8__TRGDIV" />
         </register>
         <register caption="PWM Trigger Control Register x (x = 1 through 12)" name="TRGCON9" offset="0x950" rw="RW" size="4">
            <bitfield caption="Secondary Trigger Interrupt Select" mask="0x00000040" name="STRGIS" values="TRGCON9__STRGIS" />
            <bitfield caption="Dual ADC Trigger Mode" mask="0x00000080" name="DTM" values="TRGCON9__DTM" />
            <bitfield caption="Secondary Trigger Cycle Selection bits for Dual Cycle PWM Cycles" mask="0x00000300" name="STRGSEL" values="TRGCON9__STRGSEL" />
            <bitfield caption="Trigger Cycle Selection for Dual Cycle PWM Cycles" mask="0x00000C00" name="TRGSEL" values="TRGCON9__TRGSEL" />
            <bitfield caption="Trigger x Output Divider bits" mask="0x0000F000" name="TRGDIV" values="TRGCON9__TRGDIV" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG1" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG2" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG3" offset="0x360" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG4" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG5" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG6" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG7" offset="0x760" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG8" offset="0x860" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG9" offset="0x960" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP1" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP2" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP3" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP4" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP5" offset="0x570" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP6" offset="0x670" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP7" offset="0x770" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP8" offset="0x870" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP9" offset="0x970" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON1" offset="0x180" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON1__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON1__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON1__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON1__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON1__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON1__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON2" offset="0x280" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON2__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON2__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON2__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON2__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON2__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON2__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON3" offset="0x380" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON3__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON3__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON3__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON3__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON3__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON3__PHR" />
         </register>
