Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON4__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON4__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON4__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON5__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON5__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON5__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON6__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON6__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON6__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON7__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON7__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON7__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON8__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON8__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON8__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Chopping Enable bit" name="AUXCON9__CHOPLEN">
         <value caption="PWMxL chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxL chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Chopping Enable bit" name="AUXCON9__CHOPHEN">
         <value caption="PWMxH chopping function is enabled" name="" value="0x1" />
         <value caption="PWMxH chopping function is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM Chop Clock Source Select bits" name="AUXCON9__CHOPSEL">
         <value caption="PWM12H selected as CHOP clock source" name="" value="0xc" />
         <value caption="PWM11H selected as CHOP clock source" name="" value="0xb" />
         <value caption="PWM10H selected as CHOP clock source" name="" value="0xa" />
         <value caption="PWM9H selected as CHOP clock source" name="" value="0x9" />
         <value caption="PWM8H selected as CHOP clock source" name="" value="0x8" />
         <value caption="PWM7H selected as CHOP clock source" name="" value="0x7" />
         <value caption="PWM6H selected as CHOP clock source" name="" value="0x6" />
         <value caption="PWM5H selected as CHOP clock source" name="" value="0x5" />
         <value caption="PWM4H selected as CHOP clock source" name="" value="0x4" />
         <value caption="PWM3H selected as CHOP clock source" name="" value="0x3" />
         <value caption="PWM2H selected as CHOP clock source" name="" value="0x2" />
         <value caption="PWM1H selected as CHOP clock source" name="" value="0x1" />
         <value caption="Chop clock generator selected as CHOP clock source" name="" value="0x0" />
      </value-group>
   </module>
