Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/atdf/PIC32MK0256MCJ064.atdf
      <value-group caption="High Baud Rate Enable bit" name="U2MODE__BRGH">
         <value caption="High-Speed mode 4x baud clock enabled" name="" value="0x1" />
         <value caption="Standard Speed mode 16x baud clock enabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Polarity Inversion bit" name="U2MODE__RXINV">
         <value caption="UxRX Idle state is 0" name="" value="0x1" />
         <value caption="UxRX Idle state is 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto-Baud Enable bit" name="U2MODE__ABAUD">
         <value caption="Enable baud rate measurement on the next character requires reception of Sync character (0x55); cleared by hardware upon completion" name="" value="0x1" />
         <value caption="Baud rate measurement disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Loopback Mode Select bit" name="U2MODE__LPBACK">
         <value caption="Loopback mode is enabled" name="" value="0x1" />
         <value caption="Loopback mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Wake-up on Start bit Detect During Sleep Mode bit" name="U2MODE__WAKE">
         <value caption="Wake-up enabled" name="" value="0x1" />
         <value caption="Wake-up disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Enable bits" name="U2MODE__UEN">
         <value caption="UxTX, UxRX and UxBCLK pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x3" />
         <value caption="UxTX, UxRX, UxCTS and UxRTS pins are enabled and used" name="" value="0x2" />
         <value caption="UxTX, UxRX and UxRTS pins are enabled and used; UxCTS pin is controlled by corresponding bits in the PORTx register" name="" value="0x1" />
         <value caption="UxTX and UxRX pins are enabled and used; UxCTS and UxRTS/UxBCLK pins are controlled by corresponding bits in the PORTx register" name="" value="0x0" />
      </value-group>
      <value-group caption="Mode Selection for UxRTS Pin bit" name="U2MODE__RTSMD">
         <value caption="UxRTS pin is in Simplex mode" name="" value="0x1" />
         <value caption="UxRTS pin is in Flow Control mode" name="" value="0x0" />
      </value-group>
      <value-group caption="IrDA  Encoder and Decoder Enable bit" name="U2MODE__IREN">
         <value caption="IrDA is enabled" name="" value="0x1" />
         <value caption="IrDA is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="U2MODE__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Enable bit" name="U2MODE__ON">
         <value caption="UARTx module is enabled. UARTx pins are controlled by UARTx as defined by UEN and UTXEN control bits" name="" value="0x1" />
         <value caption="UARTx module is disabled. All UARTx pins are controlled by corresponding bits in the PORTx" name="" value="0x0" />
      </value-group>
      <value-group caption="Run During Overflow Mode bit" name="U2MODE__RUNOVF">
         <value caption="Shift register continues to run when Overflow (OERR) condition is detected" name="" value="0x1" />
         <value caption="Shift register stops accepting new data when Overflow (OERR) condition is detected" name="" value="0x0" />
      </value-group>
      <value-group caption="UARTx Module Clock Selection bits" name="U2MODE__CLKSEL">
         <value caption="BRG clock is REFCLK1" name="" value="0x3" />
         <value caption="BRG clock is FRC" name="" value="0x2" />
         <value caption="BRG clock is SYSCLK (turned off in Sleep mode)" name="" value="0x1" />
         <value caption="BRG clock is PBCLKx (turned off in Sleep mode)" name="" value="0x0" />
      </value-group>
      <value-group caption="USART Clock Status bit" name="U2MODE__ACTIVE">
         <value caption="UART clock is ready" name="" value="0x1" />
         <value caption="UART clock is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Run During Sleep Enable bit" name="U2MODE__SLPEN">
         <value caption="BRG clock runs during Sleep mode" name="" value="0x1" />
         <value caption="BRG clock is turned off during Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Data Available bit (read-only)" name="U1STA__URXDA">
         <value caption="Receive buffer has data" name="" value="0x1" />
         <value caption="Receive buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Overrun Error Status bit." name="U1STA__OERR">
         <value caption="Receive buffer has overflowed" name="" value="0x1" />
         <value caption="Receive buffer has not overflowed" name="" value="0x0" />
      </value-group>
      <value-group caption="Framing Error Status bit (read-only)" name="U1STA__FERR">
         <value caption="Framing error has been detected for the current character" name="" value="0x1" />
         <value caption="Framing error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Parity Error Status bit (read-only)" name="U1STA__PERR">
         <value caption="Parity error has been detected for the current character" name="" value="0x1" />
         <value caption="Parity error has not been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Idle bit (read-only)" name="U1STA__RIDLE">
         <value caption="Receiver is Idle" name="" value="0x1" />
         <value caption="Data is being received" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Character Detect bit (bit 8 of received data = 1)" name="U1STA__ADDEN">
         <value caption="Address Detect mode is enabled. If 9-bit mode is not selected" name="" value="0x1" />
         <value caption="Address Detect mode is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Interrupt Mode Selection bit" name="U1STA__URXISEL">
         <value caption="Interrupt flag bit is asserted while receive buffer is 3/4 or more full" name="" value="0x2" />
         <value caption="Interrupt flag bit is asserted while receive buffer is 1/2 or more full" name="" value="0x1" />
         <value caption="Interrupt flag bit is asserted while receive buffer is not empty (i.e." name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Shift Register is Empty bit (read-only)" name="U1STA__TRMT">
         <value caption="Transmit shift register is empty and transmit buffer is empty (the last transmission has completed)" name="" value="0x1" />
         <value caption="Transmit shift register is not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit (read-only)" name="U1STA__UTXBF">
         <value caption="Transmit buffer is full" name="" value="0x1" />
         <value caption="Transmit buffer is not full" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Enable bit" name="U1STA__UTXEN">
         <value caption="UARTx transmitter is enabled. UxTX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx transmitter is disabled. Any pending transmission is aborted and buffer is reset" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Break bit" name="U1STA__UTXBRK">
         <value caption="Send Break on next transmission. Start bit followed by twelve 0 bits" name="" value="0x1" />
         <value caption="Break transmission is disabled or completed" name="" value="0x0" />
      </value-group>
      <value-group caption="Receiver Enable bit" name="U1STA__URXEN">
         <value caption="UARTx receiver is enabled. UxRX pin is controlled by UARTx (if ON = 1)" name="" value="0x1" />
         <value caption="UARTx receiver is disabled. UxRX pin is ignored by the UARTx module" name="" value="0x0" />
      </value-group>
